mancausoft/micropython/ports/esp32/boards/ESP32_C6_DEV_KIT_N8/mpconfigboard.h
// This configuration is for ESP32-C6-DEV-KIT-N8 board

#define MICROPY_HW_BOARD_NAME               "ESP32C6 Dev Kit N8"
#define MICROPY_HW_MCU_NAME                 "ESP32C6"

#define MICROPY_HW_ENABLE_SDCARD            (0)
#define MICROPY_PY_MACHINE_DAC              (0)
#define MICROPY_PY_MACHINE_I2S              (0)

#define MICROPY_PY_BLUETOOTH (0)
#define MICROPY_BLUETOOTH_NIMBLE (0)
